------------------------------------------------------
Sensitivity analysis for volumetric heat capacities
------------------------------------------------------

#+BEGIN_SRC ipython :session 
  %matplotlib inline
  import matplotlib.pyplot as plt
  import numpy as np

  import sys
  import os
  os.chdir("/home/jk125262/PythonDir")
  from mypackage.plot import specs as sc
  from mypackage.run import runmodule as rm
#+END_SRC

#+RESULTS:

** Sensitivity matrix 

Calculate the sensitivty matrix (sense) at different time points
- sense[it,imon,ilet]
  - it: Time index
  - imon: Monitoring point (0:8 outer, 8:16 inner)
  - ilet: Different runs with different volumetric heat capacities

#+BEGIN_SRC ipython :session   :exports both
  sc.model_name = 'cubey'

  sc.truedat = '2017_01_15'
  sc.truelet = 'a'

  sc.dat = '2017_01_15'
  sc.lets = [rm.get_let_num(i) for i in range(1000)]

  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([5,num_mons,len(sc.lets)])

  l = np.arange(0.5,3.5,0.003)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'.npy')

    sense[:,:,i] = temp[[350,375,400,425,500],:]
    t = np.load('output/sensitivity/npy/truet_'+sc.model_name+'_'+sc.dat+'_'+let+'.npy')[[350,375,400,425,500]]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 5 | 16 | 1000 |


** Temperature differences 
#+BEGIN_SRC ipython :session   :exports both
  [str(sense[i,0,-1]-sense[i,0,0]) for i in [0,1,2]]
#+END_SRC

#+RESULTS:
| 0.463538 | 0.656499 | 0.0 |

** Sensitivity matrix 

Calculate the sensitivty matrix (sense) at different time points
- sense[it,imon,ilet]
  - it: Time index
  - imon: Monitoring point (0:8 outer, 8:16 inner)
  - ilet: Different runs with different volumetric heat capacities

#+BEGIN_SRC ipython :session   :exports both
  sc.model_name = 'cubey'

  sc.truedat = '2017_01_16'
  sc.truelet = 'a'

  sc.dat = '2017_01_16'
  sc.lets = [rm.get_let_num(i) for i in range(1000)]

  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(0.5,3.5,0.003)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

** Sensitivity matrix 

Calculate the sensitivty matrix (sense) at different time points
- sense[it,imon,ilet]
  - it: Time index
  - imon: Monitoring point (0:8 outer, 8:16 inner)
  - ilet: Different runs with different volumetric heat capacities

#+BEGIN_SRC ipython :session   :exports both
  sc.model_name = 'cubey'

  sc.truedat = '2017_01_16'
  sc.truelet = 'aln'

  sc.dat = '2017_01_16'
  sc.lets = [rm.get_let_num(i) for i in range(1000)]

  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(0.5,3.5,0.003)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |
** Sensitivity matrix 

Calculate the sensitivty matrix (sense) at different time points
- sense[it,imon,ilet]
  - it: Time index
  - imon: Monitoring point (0:8 outer, 8:16 inner)
  - ilet: Different runs with different volumetric heat capacities

#+BEGIN_SRC ipython :session   :exports both
  sc.model_name = 'cubey'

  sc.truedat = '2017_01_16'
  sc.truelet = 'bxz'

  sc.dat = '2017_01_16'
  sc.lets = [rm.get_let_num(i) for i in range(1000)]

  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(0.5,3.5,0.003)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

